# yolov7-tiny.yaml

# parameters
nc: 7  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16 
  - [116,90, 156,198, 373,326]  # P5/32

# CSPDarknet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]], # 0

   [-1, 1, Conv, [64, 3, 2]], # 1-P1/2
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 1, 1]], # 3

   [-1, 1, Conv, [128, 3, 2]], # 4-P2/4
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 1, 1]], # 6
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]], # 8
   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]], # 10
   [-1, 1, Conv, [128, 3, 1]], # 11

   [-1, 1, Conv, [256, 3, 2]], # 12-P3/8
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 1, 1]], # 14
   [-1, 1, Conv, [128, 3, 1]], 
   [-1, 1, Conv, [128, 3, 1]], # 16
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]], # 18 
   [-1, 1, Conv, [256, 3, 1]], # 19

   [-1, 1, Conv, [512, 3, 2]], # 20-P4/16
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 1, 1]], # 22
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]], # 24
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]], # 26
   [-1, 1, Conv, [512, 3, 1]], # 27  

  ]

# yolov7 head
head:
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, Conv, [128, 1, 1]],  # 28

   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [255, 1, 1]], # pred

   [-1, 1, Conv, [128, 1, 1]], 
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [128, 1, 1]], # 29 (semantic segmentation for depth coefficients)

   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [255, 1, 1]], # pred

   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [255, 1, 1]], # pred
  ]